blogs/maven-howto.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Maven HowTo</title>
<!-- 2016-01-11 一 11:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="zhengzhiyong" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Maven HowTo</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. maven 简介</a></li>
<li><a href="#sec-2">2. 安装 maven</a></li>
<li><a href="#sec-3">3. 创建项目</a></li>
<li><a href="#sec-4">4. 样板 pom.xml</a></li>
<li><a href="#sec-5">5. 常用的maven命令和选项</a></li>
<li><a href="#sec-6">6. mvn test 常用选项</a></li>
<li><a href="#sec-7">7. 管理依赖</a></li>
<li><a href="#sec-8">8. 常用的maven插件</a>
<ul>
<li><a href="#sec-8-1">8.1. maven-compiler-plugin 插件</a></li>
<li><a href="#sec-8-2">8.2. maven-war-plugin</a></li>
<li><a href="#sec-8-3">8.3. maven-assembly-plugin</a></li>
<li><a href="#sec-8-4">8.4. jetty-maven-plugin</a></li>
<li><a href="#sec-8-5">8.5. maven-pmd-plugin</a></li>
<li><a href="#sec-8-6">8.6. findbugs-maven-plugin</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> maven 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
我们先不谈maven是什么，我们先说，我们开发一个应用需要什么
</p>
<ul class="org-ul">
<li>编译，测试，运行，打包
</li>
<li>管理依赖
</li>
<li>项目报告
</li>
</ul>
<p>
好的，maven以统一的形式提供了这些功能，虽然几乎所有功能都是以插件的形式提供的。
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 安装 maven</h2>
<div class="outline-text-2" id="text-2">
<p>
安装很简单，下载源码，解压，把bin目录添加到 PATH 路径即可。
</p>
<div class="org-src-container">

<pre class="src src-bash"># mvn -version
Apache Maven 3.3.3 (7994120775791599e205a5524ec3e0dfe41d4a06; 2015-04-22T19:57:37+08:00)
</pre>
</div>

<p>
能正确运行，说明安装成功
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 创建项目</h2>
<div class="outline-text-2" id="text-3">
<p>
要使用maven，项目必须符合一定的目录规范，最简单的方法就是用maven来创建项目。
</p>
<pre class="example">
# mvn archetype:generate -DgroupId=example -DartifactId=howto -DarchetypeArtifactId=maven-archetype-quickstart -DinteractiveMode=false
# tree howto
howto/
├── pom.xml
└── src
    ├── main
    │   └── java
    │       └── example
    │           └── App.java
    └── test
        └── java
            └── example
                └── AppTest.java
</pre>
</div>
</div>



<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 样板 pom.xml</h2>
<div class="outline-text-2" id="text-4">
<p>
除了目录结构外，pom.xml 是 maven 的核心， <code>package</code> 是包的类型 <code>jar</code> 或者 <code>war</code> ， <code>properties</code> 中定义的值可以在其它地方引用， <code>dependencies</code> 定义依赖， <code>build</code> 定义构建过程需要的插件， <code>reporting</code> 定义构建完后的一些报告插件。maven的大部分功能都是通过插件提供的，后面会说一些比较有用的插件。
</p>

<div class="org-src-container">

<pre class="src src-xml">&lt;<span style="color: #0000ff; font-weight: bold;">project</span> <span style="color: #0000ff; font-weight: bold;">xmlns</span>=<span style="color: #00ff00;">"</span><span style="color: #00ff00;">http://maven.apache.org/POM/4.0.0</span><span style="color: #00ff00;">"</span>
         <span style="color: #0000ff; font-weight: bold;">xmlns</span>:<span style="color: #ffff00;">xsi</span>=<span style="color: #00ff00;">"</span><span style="color: #00ff00;">http://www.w3.org/2001/XMLSchema-instance</span><span style="color: #00ff00;">"</span>
         <span style="color: #0000ff; font-weight: bold;">xsi</span>:<span style="color: #ffff00;">schemaLocation</span>=<span style="color: #00ff00;">"</span><span style="color: #00ff00;">http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd</span><span style="color: #00ff00;">"</span>&gt;

  &lt;<span style="color: #0000ff; font-weight: bold;">modelVersion</span>&gt;4.0.0&lt;/<span style="color: #0000ff; font-weight: bold;">modelVersion</span>&gt;
  &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;example&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
  &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;howto&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
  &lt;<span style="color: #0000ff; font-weight: bold;">packaging</span>&gt;war&lt;/<span style="color: #0000ff; font-weight: bold;">packaging</span>&gt;
  &lt;<span style="color: #0000ff; font-weight: bold;">version</span>&gt;1.0-SNAPSHOT&lt;/<span style="color: #0000ff; font-weight: bold;">version</span>&gt;
  &lt;<span style="color: #0000ff; font-weight: bold;">name</span>&gt;howto&lt;/<span style="color: #0000ff; font-weight: bold;">name</span>&gt;
  &lt;<span style="color: #0000ff; font-weight: bold;">url</span>&gt;http://maven.apache.org&lt;/<span style="color: #0000ff; font-weight: bold;">url</span>&gt;

  &lt;<span style="color: #0000ff; font-weight: bold;">properties</span>&gt;
    &lt;<span style="color: #0000ff; font-weight: bold;">project.build.sourceEncoding</span>&gt;UTF-8&lt;/<span style="color: #0000ff; font-weight: bold;">project.build.sourceEncoding</span>&gt;
    &lt;<span style="color: #0000ff; font-weight: bold;">java.version</span>&gt;1.8&lt;/<span style="color: #0000ff; font-weight: bold;">java.version</span>&gt;
    &lt;<span style="color: #0000ff; font-weight: bold;">spring-boot.version</span>&gt;1.2.7.RELEASE&lt;/<span style="color: #0000ff; font-weight: bold;">spring-boot.version</span>&gt;
    &lt;<span style="color: #0000ff; font-weight: bold;">jetty.http.port</span>&gt;8180&lt;/<span style="color: #0000ff; font-weight: bold;">jetty.http.port</span>&gt;
  &lt;/<span style="color: #0000ff; font-weight: bold;">properties</span>&gt;

  &lt;<span style="color: #0000ff; font-weight: bold;">dependencies</span>&gt;
    &lt;<span style="color: #0000ff; font-weight: bold;">dependency</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;org.springframework.boot&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;spring-boot-starter-ws&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">version</span>&gt;${spring-boot.version}&lt;/<span style="color: #0000ff; font-weight: bold;">version</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">exclusions</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">exclusion</span>&gt;
          &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;org.springframework.boot&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
          &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;spring-boot-starter-tomcat&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
        &lt;/<span style="color: #0000ff; font-weight: bold;">exclusion</span>&gt;
      &lt;/<span style="color: #0000ff; font-weight: bold;">exclusions</span>&gt;
    &lt;/<span style="color: #0000ff; font-weight: bold;">dependency</span>&gt;

    &lt;<span style="color: #0000ff; font-weight: bold;">dependency</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;org.springframework.boot&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;spring-boot-starter-jetty&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">version</span>&gt;${spring-boot.version}&lt;/<span style="color: #0000ff; font-weight: bold;">version</span>&gt;
    &lt;/<span style="color: #0000ff; font-weight: bold;">dependency</span>&gt;

    &lt;<span style="color: #0000ff; font-weight: bold;">dependency</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;junit&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;junit&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">version</span>&gt;4.12&lt;/<span style="color: #0000ff; font-weight: bold;">version</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">scope</span>&gt;test&lt;/<span style="color: #0000ff; font-weight: bold;">scope</span>&gt;
    &lt;/<span style="color: #0000ff; font-weight: bold;">dependency</span>&gt;
  &lt;/<span style="color: #0000ff; font-weight: bold;">dependencies</span>&gt;

  &lt;<span style="color: #0000ff; font-weight: bold;">build</span>&gt;
    &lt;<span style="color: #0000ff; font-weight: bold;">plugins</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;org.apache.maven.plugins&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;maven-compiler-plugin&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">version</span>&gt;3.3&lt;/<span style="color: #0000ff; font-weight: bold;">version</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">configuration</span>&gt;
          &lt;<span style="color: #0000ff; font-weight: bold;">compilerArgs</span>&gt;
            &lt;<span style="color: #0000ff; font-weight: bold;">arg</span>&gt;-Xlint:unchecked&lt;/<span style="color: #0000ff; font-weight: bold;">arg</span>&gt;
          &lt;/<span style="color: #0000ff; font-weight: bold;">compilerArgs</span>&gt;
          &lt;<span style="color: #0000ff; font-weight: bold;">source</span>&gt;${java.version}&lt;/<span style="color: #0000ff; font-weight: bold;">source</span>&gt;
          &lt;<span style="color: #0000ff; font-weight: bold;">target</span>&gt;${java.version}&lt;/<span style="color: #0000ff; font-weight: bold;">target</span>&gt;
        &lt;/<span style="color: #0000ff; font-weight: bold;">configuration</span>&gt;
      &lt;/<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;org.apache.maven.plugins&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;maven-war-plugin&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">version</span>&gt;2.6&lt;/<span style="color: #0000ff; font-weight: bold;">version</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">configuration</span>&gt;
          &lt;<span style="color: #0000ff; font-weight: bold;">failOnMissingWebXml</span>&gt;false&lt;/<span style="color: #0000ff; font-weight: bold;">failOnMissingWebXml</span>&gt;
        &lt;/<span style="color: #0000ff; font-weight: bold;">configuration</span>&gt;
      &lt;/<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;org.eclipse.jetty&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;jetty-maven-plugin&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">version</span>&gt;9.3.4.RC1&lt;/<span style="color: #0000ff; font-weight: bold;">version</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">configuration</span>&gt;
          &lt;<span style="color: #0000ff; font-weight: bold;">httpConnector</span>&gt;
            &lt;<span style="color: #0000ff; font-weight: bold;">port</span>&gt;${jetty.http.port}&lt;/<span style="color: #0000ff; font-weight: bold;">port</span>&gt;
          &lt;/<span style="color: #0000ff; font-weight: bold;">httpConnector</span>&gt;
        &lt;/<span style="color: #0000ff; font-weight: bold;">configuration</span>&gt;
      &lt;/<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;
    &lt;/<span style="color: #0000ff; font-weight: bold;">plugins</span>&gt;
  &lt;/<span style="color: #0000ff; font-weight: bold;">build</span>&gt;

  &lt;<span style="color: #0000ff; font-weight: bold;">reporting</span>&gt;
    &lt;<span style="color: #0000ff; font-weight: bold;">plugins</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;org.apache.maven.plugins&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;maven-pmd-plugin&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">version</span>&gt;3.6&lt;/<span style="color: #0000ff; font-weight: bold;">version</span>&gt;
      &lt;/<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;
      &lt;<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;org.codehaus.mojo&lt;/<span style="color: #0000ff; font-weight: bold;">groupId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;findbugs-maven-plugin&lt;/<span style="color: #0000ff; font-weight: bold;">artifactId</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">version</span>&gt;3.0.3&lt;/<span style="color: #0000ff; font-weight: bold;">version</span>&gt;
        &lt;<span style="color: #0000ff; font-weight: bold;">configuration</span>&gt;
          &lt;<span style="color: #0000ff; font-weight: bold;">excludeFilterFile</span>&gt;findbugs-exclude.xml&lt;/<span style="color: #0000ff; font-weight: bold;">excludeFilterFile</span>&gt;
        &lt;/<span style="color: #0000ff; font-weight: bold;">configuration</span>&gt;
      &lt;/<span style="color: #0000ff; font-weight: bold;">plugin</span>&gt;      
    &lt;/<span style="color: #0000ff; font-weight: bold;">plugins</span>&gt;
  &lt;/<span style="color: #0000ff; font-weight: bold;">reporting</span>&gt;
&lt;/<span style="color: #0000ff; font-weight: bold;">project</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 常用的maven命令和选项</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>mvn compile 编译
</li>
<li>mvn package 打 <code>war</code> 或者 <code>jar</code> 包
</li>
<li>mvn clean 清除 package 或其它过程中产生的中间文件
</li>
<li>mvn dependency:help 查看 dependency 插件的帮助
</li>
<li>mvn site 查看项目报告，把 target/site 配置到 http doc 目录，可以以web方式查看
</li>
</ul>

<p>
通过 -D 参数指定环境变量，例如 -Dmaven.test.skip=true 用来跳过测试
</p>

<p>
目标是可以组合的，例如 mvn clean package jetty:run
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> mvn test 常用选项</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>-Dtest=TestCircle 只测试 TestCircle
</li>
<li>-Dtest=TestCi*le  模糊匹配
</li>
<li>-Dtest=TestSquare,TestCi*le 指定多个
</li>
<li>-Dtest=TestCircle#mytest 指定方法
</li>
<li>-Dtest=TestCircle#test* 模糊匹配
</li>
<li>-Dtest=TestCircle#testOne+testTwo 指定多个方法
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 管理依赖</h2>
<div class="outline-text-2" id="text-7">
<p>
通过 <code>dependency</code> 填写依赖，maven会在本地缓存一份数据 <code>$HOME/.m2/repository</code>
依赖管理是个很便捷的东西。c和c++就没有类似的项目，Makefile 里面指定的依赖额外安装。
</p>
</div>
</div>

<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> 常用的maven插件</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> maven-compiler-plugin 插件</h3>
<div class="outline-text-3" id="text-8-1">
<p>
编译插件，配置编译选项
</p>
</div>
</div>

<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> maven-war-plugin</h3>
<div class="outline-text-3" id="text-8-2">
<p>
打war包插件，配置打包选项
</p>
</div>
</div>

<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> maven-assembly-plugin</h3>
<div class="outline-text-3" id="text-8-3">
<p>
打独立运行的jar包
</p>
</div>
</div>

<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> jetty-maven-plugin</h3>
<div class="outline-text-3" id="text-8-4">
<p>
jetty插件，通过 mvn jetty:run 运行war包
</p>
</div>
</div>

<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> maven-pmd-plugin</h3>
<div class="outline-text-3" id="text-8-5">
<p>
源码分析插件，发现隐藏的bug
</p>
</div>
</div>

<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> findbugs-maven-plugin</h3>
<div class="outline-text-3" id="text-8-6">
<p>
代码静态分析，发现隐藏的bug
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zhengzhiyong</p>
<p class="date">Created: 2016-01-11 一 11:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
